subjects = [
    "Статистика",
    "Окно",
    "РВ",
    "ОБЖ",
    "География",
    "Физкультура",
    "Литература",
    "История Церкви",
    "Английский",
    "ИП",
    "Химия",
    "ДРЯ",
    "Русский язык",
    "ЦСЯ",
    "Литургика",
    "Биология",
    "Информатика",
    "Обществознание",
    "История",
    "Физика",
    "ОПВ",
    "Алгебра",
    "Геометрия",
]


def get_schedule_with_class(class_name: str) -> dict:
    array = schedule_json[class_name]
    return {i: [j for j in array[i]] for i in array}


schedule_json = {
    "10А": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
    "10Б": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
    "10В": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
    "11А": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
    "11Б": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
    "11В": {
        "понедельник": [],
        "вторник": [],
        "среда": [],
        "четверг": [],
        "пятница": [],
        "суббота": [],
    },
}
